"""
Файл - для общей замены сообщений в боте
"""

INCORRECT_INPUT = 'Ошибка ввода! Данной команды не существует!'
WELCOME = 'Добро пожаловать!'
HELP = 'Бот предназначен для.....!\n\nКоманды бота:\n/make_a_deal - Внести сделку\n/help - Помощь'
PARTNER_ID = 'Укажите ID партнера'
INCORRECT_PARTNER_ID = 'Ошибка ввода! ID должен состоять только из цифр'
EMPTY_PARTNER = 'Партнера с таким ID нет в базе.\nПовторите ввод.'
FIRST_CUR = 'Выберите валюту приема'
FIRST_AMOUNT = 'Введите сумму приема'
INCORRECT_AMOUNT = 'Ошибка ввода! Сумма должна состоять только из цифр'
SECOND_CUR = 'Выберите валюту выплаты'
SECOND_AMOUNT = 'Введите сумму выплаты'
CITY = 'Введите город получения'
PROFIT = 'Введите прибыль партнера в рублях'
INCORRECT_PROFIT = 'Ошибка ввода! Прибыль должна состоять только из цифр'
COMPLETE = 'Данные сделки записаны'
