"""
Файл - для общей замены сообщений в боте
"""

INCORRECT_INPUT = 'Ошибка ввода! Данной команды не существует!'
WELCOME = 'Добро пожаловать! Вас приветствует криптовалютный бот по заключению сделок!'
HELP = 'Бот предназначен для заключения сделок по покупке и продаже ' \
       'криптовалют!\n\nКоманды бота:\n/buy - Купить\n/sell - Продать\n/help - Помощь'
SELL_CUR = 'Выберите валюту продажи'
BUY_CUR = 'Выберите валюту покупки'
QUANTITY_BUY = 'Сколько вы хотите купить монет?'
QUANTITY_SELL = 'Сколько вы хотите продать монет?'
INCORRECT_AMOUNT = 'Ошибка ввода! Количество монет должно быть числом\nПовторите ввод снова.'
BUY_FIAT_CUR = 'За какую валюту будете совершать покупку'
SELL_FIAT_CUR = 'На какую валюту будете совершать продажу'
CITY = 'Введите город обмена'
COMPLETE = 'Для продолжения заявки свяжитесь, пожалуйста с оператором: {}'
OPERATOR = '*Поступила новая заявка!*\n\n*Тип заявки:* {}\n*Пользователь:* {}\n*Дата и время создания:* {}' \
           '\n*Криптовалюта:* {}\n*Количество:* {}\n*Фиатная валюта:* {}\n*Город:* {}'
